Repository: xiaocang/easydict_win32
Catalog: dotnet/src/Easydict.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, da_dk, de_de, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, ms_my, th_th, vi_vn, zh_cn, zh_tw

# LayoutDetection_DetectionMode
source: Detection Mode
zh_cn: 检测模式

# LayoutDetection_VisionService
source: Vision Service
zh_cn: 视觉服务

# DocumentOutputMode_Title
source: Document Output Mode
fr_fr: Mode de sortie du document
ja_jp: ドキュメント出力モード
ko_kr: 문서 출력 모드
zh_cn: 文档输出模式
zh_tw: 文件輸出模式

# DocumentOutputMode_Description
source: Choose output format. Bilingual mode interleaves original and translated content.
fr_fr: Choisissez le format de sortie. Le mode bilingue alterne le contenu original et traduit.
ja_jp: 出力形式を選択します。バイリンガルモードは原文と翻訳を交互に配置します。
ko_kr: 출력 형식을 선택합니다. 이중 언어 모드는 원문과 번역을 교대로 배치합니다.
zh_cn: 选择输出格式。双语模式将原文和译文交替排列。
zh_tw: 選擇輸出格式。雙語模式將原文和譯文交替排列。

# DocumentOutputMode_Monolingual
source: Monolingual (Default)
fr_fr: Monolingue (Par défaut)
ja_jp: 単言語（デフォルト）
ko_kr: 단일 언어 (기본값)
zh_cn: 单语（默认）
zh_tw: 單語（預設）

# DocumentOutputMode_Bilingual
source: Bilingual (Interleaved)
fr_fr: Bilingue (Alternée)
ja_jp: バイリンガル（交互配置）
ko_kr: 이중 언어 (교대 배치)
zh_cn: 双语（交替排列）
zh_tw: 雙語（交替排列）

# DocumentOutputMode_Both
source: Both
fr_fr: Les deux
ja_jp: 両方
ko_kr: 모두
zh_cn: 同时生成
zh_tw: 同時產生

# DocumentOutputMode_Note
source: Bilingual PDF: interleaved pages. Markdown/Text: original + translation blocks.
fr_fr: PDF bilingue : pages alternées. Markdown/Texte : blocs original+traduction.
ja_jp: バイリンガルPDF：交互ページ。Markdown/テキスト：原文+翻訳ブロック。
ko_kr: 이중 언어 PDF: 교대 페이지. Markdown/텍스트: 원문+번역 블록.
zh_cn: PDF 双语：交替页面。Markdown/文本：原文+译文段落。
zh_tw: PDF 雙語：交替頁面。Markdown/文字：原文+譯文段落。

# TranslationConcurrency_Title
source: Translation Concurrency
fr_fr: Traduction simultanée
ja_jp: 翻訳同時実行数
ko_kr: 번역 동시 실행 수
zh_cn: 翻译并发数
zh_tw: 翻譯並行數

# TranslationConcurrency_Description
source: Maximum number of parallel translation requests for long document translation. Higher values speed up translation but may hit API rate limits.
fr_fr: Nombre maximum de requêtes de traduction parallèles pour les longs documents. Des valeurs plus élevées accélèrent la traduction mais peuvent atteindre les limites de l'API.
ja_jp: 長文ドキュメント翻訳の最大並列リクエスト数。値を大きくすると翻訳速度が向上しますが、APIレート制限に達する可能性があります。
ko_kr: 긴 문서 번역의 최대 병렬 요청 수입니다. 값이 높을수록 번역 속도가 빨라지지만 API 속도 제한에 도달할 수 있습니다.
zh_cn: 长文档翻译的最大并行请求数。数值越高翻译速度越快，但可能触发 API 速率限制。
zh_tw: 長文件翻譯的最大並行請求數。數值越高翻譯速度越快，但可能觸發 API 速率限制。

# TranslationConcurrency_Note
source: Recommended: 4 for LLM services, 1-2 for free API tiers with strict rate limits.
fr_fr: Recommandé : 4 pour les services LLM, 1-2 pour les API gratuites avec des limites strictes.
ja_jp: 推奨：LLMサービスは4、厳格なレート制限のある無料APIは1-2。
ko_kr: 권장: LLM 서비스는 4, 엄격한 속도 제한이 있는 무료 API는 1-2.
zh_cn: 建议：LLM 服务设为 4，有严格速率限制的免费 API 设为 1-2。
zh_tw: 建議：LLM 服務設為 4，有嚴格速率限制的免費 API 設為 1-2。

# CjkFont_Title
source: CJK Font
fr_fr: Police CJK
ja_jp: CJK フォント
ko_kr: CJK 글꼴
zh_cn: CJK 字体
zh_tw: CJK 字型

# CjkFont_Description
source: Download CJK fonts for proper Chinese, Japanese, and Korean text rendering in PDF output.
fr_fr: Téléchargez les polices CJK pour un rendu correct du chinois, japonais et coréen dans les PDF.
ja_jp: PDF出力で中国語・日本語・韓国語のテキストを正しくレンダリングするためにCJKフォントをダウンロードします。
ko_kr: PDF 출력에서 중국어, 일본어, 한국어 텍스트를 올바르게 렌더링하기 위해 CJK 글꼴을 다운로드합니다.
zh_cn: 下载 CJK 字体以在 PDF 输出中正确渲染中日韩文字。
zh_tw: 下載 CJK 字型以在 PDF 輸出中正確呈現中日韓文字。

# CjkFont_Download
source: Download CJK Font
fr_fr: Télécharger la police CJK
ja_jp: CJKフォントをダウンロード
ko_kr: CJK 글꼴 다운로드
zh_cn: 下载 CJK 字体
zh_tw: 下載 CJK 字型

# CjkFont_Delete
source: Delete
fr_fr: Supprimer
ja_jp: 削除
ko_kr: 삭제
zh_cn: 删除
zh_tw: 刪除

# CjkFont_Note
source: Downloads Noto Sans CJK (~16MB per language). Required for CJK text in PDF overlay rendering.
fr_fr: Télécharge Noto Sans CJK (~16 Mo par langue). Nécessaire pour le rendu CJK dans les PDF.
ja_jp: Noto Sans CJKをダウンロード（言語あたり約16MB）。PDFオーバーレイレンダリングに必要です。
ko_kr: Noto Sans CJK 다운로드 (언어당 약 16MB). PDF 오버레이 렌더링에 필요합니다.
zh_cn: 下载 Noto Sans CJK（每种语言约 16MB）。PDF 叠层渲染中日韩文字时必需。
zh_tw: 下載 Noto Sans CJK（每種語言約 16MB）。PDF 疊層呈現中日韓文字時必需。

# FormulaDetection_Title
source: Formula Detection
fr_fr: Détection de formules
ja_jp: 数式検出
ko_kr: 수식 감지
zh_cn: 公式检测
zh_tw: 公式偵測

# FormulaDetection_Description
source: Advanced formula detection uses font names and Unicode math characters to protect formulas from translation.
fr_fr: La détection avancée utilise les noms de polices et les caractères mathématiques Unicode pour protéger les formules de la traduction.
ja_jp: 高度な数式検出はフォント名とUnicode数学文字を使用して数式を翻訳から保護します。
ko_kr: 고급 수식 감지는 글꼴 이름과 유니코드 수학 문자를 사용하여 수식을 번역에서 보호합니다.
zh_cn: 高级公式检测使用字体名称和 Unicode 数学字符来保护公式不被翻译。
zh_tw: 進階公式偵測使用字型名稱和 Unicode 數學字元來保護公式不被翻譯。

# FormulaDetection_FontPattern
source: Font Pattern (Regex)
fr_fr: Modèle de police (Regex)
ja_jp: フォントパターン（正規表現）
ko_kr: 글꼴 패턴 (정규식)
zh_cn: 字体模式（正则）
zh_tw: 字型模式（正規表示式）

# FormulaDetection_CharPattern
source: Character Pattern (Regex)
fr_fr: Modèle de caractères (Regex)
ja_jp: 文字パターン（正規表現）
ko_kr: 문자 패턴 (정규식)
zh_cn: 字符模式（正则）
zh_tw: 字元模式（正規表示式）

# FormulaDetection_Note
source: Leave empty to use built-in patterns. Font pattern matches PDF font names (Level 2). Character pattern matches Unicode ranges (Level 3).
fr_fr: Laisser vide pour utiliser les modèles intégrés. Le modèle de police correspond aux noms de polices PDF (Niveau 2). Le modèle de caractères correspond aux plages Unicode (Niveau 3).
ja_jp: 空欄にすると組み込みパターンを使用します。フォントパターンはPDFフォント名に一致（Level 2）。文字パターンはUnicode範囲に一致（Level 3）。
ko_kr: 비워두면 기본 패턴을 사용합니다. 글꼴 패턴은 PDF 글꼴 이름과 매칭 (Level 2). 문자 패턴은 유니코드 범위와 매칭 (Level 3).
zh_cn: 留空使用内置模式。字体模式匹配 PDF 字体名（Level 2）。字符模式匹配 Unicode 范围（Level 3）。
zh_tw: 留空使用內建模式。字型模式比對 PDF 字型名稱（Level 2）。字元模式比對 Unicode 範圍（Level 3）。

# TranslationCache_Title
source: Translation Cache
fr_fr: Cache de traduction
ja_jp: 翻訳キャッシュ
ko_kr: 번역 캐시
zh_cn: 翻译缓存
zh_tw: 翻譯快取

# TranslationCache_Description
source: Cache translated segments locally to speed up repeated translations and save API costs.
fr_fr: Mettre en cache les segments traduits localement pour accélérer les traductions répétées et économiser les coûts API.
ja_jp: 翻訳済みセグメントをローカルにキャッシュして、繰り返しの翻訳を高速化しAPI費用を節約します。
ko_kr: 번역된 세그먼트를 로컬에 캐시하여 반복 번역 속도를 높이고 API 비용을 절약합니다.
zh_cn: 将已翻译的段落缓存到本地，加速重复翻译并节省 API 费用。
zh_tw: 將已翻譯的段落快取到本地，加速重複翻譯並節省 API 費用。

# TranslationCache_Clear
source: Clear Cache
fr_fr: Vider le cache
ja_jp: キャッシュをクリア
ko_kr: 캐시 지우기
zh_cn: 清除缓存
zh_tw: 清除快取

# TranslationCache_Note
source: Cached translations are stored locally in SQLite. Clear cache if translations become stale.
fr_fr: Les traductions en cache sont stockées localement dans SQLite. Videz le cache si les traductions deviennent obsolètes.
ja_jp: キャッシュされた翻訳はローカルのSQLiteに保存されます。翻訳が古くなった場合はクリアしてください。
ko_kr: 캐시된 번역은 로컬 SQLite에 저장됩니다. 번역이 오래되면 캐시를 지우세요.
zh_cn: 缓存的翻译存储在本地 SQLite 数据库中。如果翻译过时，请清除缓存。
zh_tw: 快取的翻譯儲存在本地 SQLite 資料庫中。如果翻譯過時，請清除快取。

# PageRange_Title
source: Page Range
fr_fr: Plage de pages
ja_jp: ページ範囲
ko_kr: 페이지 범위
zh_cn: 页面范围
zh_tw: 頁面範圍

# PageRange_Description
source: Specify which pages to translate. Leave empty to translate all pages.
fr_fr: Spécifiez les pages à traduire. Laissez vide pour traduire toutes les pages.
ja_jp: 翻訳するページを指定します。空欄の場合はすべてのページを翻訳します。
ko_kr: 번역할 페이지를 지정합니다. 비워두면 모든 페이지를 번역합니다.
zh_cn: 指定要翻译的页面。留空则翻译所有页面。
zh_tw: 指定要翻譯的頁面。留空則翻譯所有頁面。

# PageRange_Note
source: Formats: "1-5" (range), "3" (single page), "1-3,5,7-10" (mixed). Empty or "all" = translate all pages.
fr_fr: Formats : "1-5" (plage), "3" (page unique), "1-3,5,7-10" (mixte). Vide ou "all" = traduire toutes les pages.
ja_jp: 形式："1-5"（範囲）、"3"（単一ページ）、"1-3,5,7-10"（混合）。空欄または "all" = 全ページ翻訳。
ko_kr: 형식: "1-5" (범위), "3" (단일 페이지), "1-3,5,7-10" (혼합). 비어있거나 "all" = 모든 페이지 번역.
zh_cn: 格式："1-5"（范围）、"3"（单页）、"1-3,5,7-10"（混合）。留空或 "all" = 翻译所有页面。
zh_tw: 格式："1-5"（範圍）、"3"（單頁）、"1-3,5,7-10"（混合）。留空或 "all" = 翻譯所有頁面。

# CustomPrompt_Title
source: Custom Translation Prompt
fr_fr: Prompt de traduction personnalisé
ja_jp: カスタム翻訳プロンプト
ko_kr: 사용자 정의 번역 프롬프트
zh_cn: 自定义翻译提示词
zh_tw: 自訂翻譯提示詞

# CustomPrompt_Description
source: Add custom instructions for LLM-based translation services (OpenAI, DeepSeek, Gemini, etc.).
fr_fr: Ajoutez des instructions personnalisées pour les services de traduction basés sur LLM (OpenAI, DeepSeek, Gemini, etc.).
ja_jp: LLMベースの翻訳サービス（OpenAI、DeepSeek、Gemini等）にカスタム指示を追加します。
ko_kr: LLM 기반 번역 서비스(OpenAI, DeepSeek, Gemini 등)에 사용자 정의 지침을 추가합니다.
zh_cn: 为基于 LLM 的翻译服务（OpenAI、DeepSeek、Gemini 等）添加自定义指令。
zh_tw: 為基於 LLM 的翻譯服務（OpenAI、DeepSeek、Gemini 等）添加自訂指令。

# CustomPrompt_Note
source: These instructions are appended to the system prompt for LLM services. Has no effect on non-LLM services (Google, DeepL, etc.).
fr_fr: Ces instructions sont ajoutées au prompt système des services LLM. Sans effet sur les services non-LLM (Google, DeepL, etc.).
ja_jp: これらの指示はLLMサービスのシステムプロンプトに追加されます。非LLMサービス（Google、DeepL等）には影響しません。
ko_kr: 이 지침은 LLM 서비스의 시스템 프롬프트에 추가됩니다. 비 LLM 서비스(Google, DeepL 등)에는 영향을 미치지 않습니다.
zh_cn: 这些指令会追加到 LLM 服务的系统提示词中。对非 LLM 服务（Google、DeepL 等）无效。
zh_tw: 這些指令會追加到 LLM 服務的系統提示詞中。對非 LLM 服務（Google、DeepL 等）無效。

# LongDoc_BrowseFiles
source: Browse...
fr_fr: Parcourir...
ja_jp: 参照...
ko_kr: 찾아보기...
zh_cn: 浏览文件...
zh_tw: 瀏覽檔案...

# LongDoc_BrowseOutputFolder
source: Browse...
fr_fr: Parcourir...
ja_jp: 参照...
ko_kr: 찾아보기...
zh_cn: 浏览目录...
zh_tw: 瀏覽目錄...

# LongDoc_NoFileSelected
source: No file selected
fr_fr: Aucun fichier sélectionné
ja_jp: ファイルが選択されていません
ko_kr: 선택된 파일 없음
zh_cn: 未选择文件
zh_tw: 未選擇檔案

# LongDoc_FilesSelected
source: {0} files selected
fr_fr: {0} fichiers sélectionnés
ja_jp: {0} 個のファイルを選択
ko_kr: {0}개 파일 선택됨
zh_cn: 已选择 {0} 个文件
zh_tw: 已選擇 {0} 個檔案

# LongDoc_OutputNamingHint
source: Output: {filename}_translated.pdf
fr_fr: Sortie : {filename}_translated.pdf
ja_jp: 出力: {filename}_translated.pdf
ko_kr: 출력: {filename}_translated.pdf
zh_cn: 输出：{filename}_translated.pdf
zh_tw: 輸出：{filename}_translated.pdf

# LongDoc_ServiceHint
source: Configure services in Settings
fr_fr: Configurer les services dans les paramètres
ja_jp: 設定でサービスを構成
ko_kr: 설정에서 서비스 구성
zh_cn: 在设置中配置服务
zh_tw: 在設定中配置服務

# LongDoc_OnnxDownloadTitle
source: Download Layout Model
fr_fr: Télécharger le modèle de mise en page
ja_jp: レイアウトモデルをダウンロード
ko_kr: 레이아웃 모델 다운로드
zh_cn: 下载版面检测模型
zh_tw: 下載版面偵測模型

# LongDoc_OnnxDownloadMessage
source: Layout detection model (~75MB) improves document structure recognition. Download now?
fr_fr: Le modèle de détection de mise en page (~75 Mo) améliore la reconnaissance de la structure du document. Télécharger maintenant ?
ja_jp: レイアウト検出モデル（約75MB）はドキュメント構造の認識を改善します。ダウンロードしますか？
ko_kr: 레이아웃 감지 모델(~75MB)은 문서 구조 인식을 개선합니다. 지금 다운로드하시겠습니까?
zh_cn: 版面检测模型（约75MB）可提升文档结构识别效果。是否下载？
zh_tw: 版面偵測模型（約75MB）可提升文件結構辨識效果。是否下載？

# LongDoc_OnnxDownloadFailed_Fallback
source: Layout model download failed. Continuing with basic layout detection.
fr_fr: Échec du téléchargement du modèle de mise en page. La traduction continue avec la détection de mise en page basique.
ja_jp: レイアウトモデルのダウンロードに失敗しました。基本レイアウト検出で翻訳を続行します。
ko_kr: 레이아웃 모델 다운로드에 실패했습니다. 기본 레이아웃 감지로 번역을 계속합니다.
zh_cn: 版面检测模型下载失败，将使用基础版面检测继续翻译。
zh_tw: 版面偵測模型下載失敗，將使用基礎版面偵測繼續翻譯。

# LongDoc_InputModeHelpTip
source: Choose input format: Text (plain text), Markdown, or PDF. PDF mode supports ML layout detection for better accuracy.
fr_fr: Choisir le format d'entrée : Texte (texte brut), Markdown ou PDF. Le mode PDF prend en charge la détection ML de mise en page pour une meilleure précision.
ja_jp: 入力形式を選択：テキスト（プレーンテキスト）、Markdown、または PDF。PDF モードは ML レイアウト検出をサポートし、精度が向上します。
ko_kr: 입력 형식 선택: 텍스트(일반 텍스트), Markdown 또는 PDF. PDF 모드는 ML 레이아웃 감지를 지원하여 정확도가 향상됩니다.
zh_cn: 选择输入格式：文本（纯文本）、Markdown 或 PDF。PDF 模式支持 ML 版面检测以提高准确性。
zh_tw: 選擇輸入格式：文字（純文字）、Markdown 或 PDF。PDF 模式支援 ML 版面偵測以提高準確性。

# LongDoc_OutputModeHelpTip
source: Mono: target language only. Bilingual: source and target side by side. Both: generates both mono and bilingual outputs.
fr_fr: Mono : langue cible uniquement. Bilingue : source et cible côte à côte. Les deux : génère des sorties monolingues et bilingues.
ja_jp: モノ：ターゲット言語のみ。バイリンガル：ソースとターゲットを並列表示。両方：モノとバイリンガルの両方を生成します。
ko_kr: 단일: 대상 언어만. 이중: 원본과 대상을 나란히 표시. 모두: 단일 및 이중 출력을 모두 생성합니다.
zh_cn: 单语：仅目标语言。双语：源语言和目标语言并排显示。两者：同时生成单语和双语输出。
zh_tw: 單語：僅目標語言。雙語：來源語言和目標語言並排顯示。兩者：同時產生單語和雙語輸出。

# LongDoc_ConcurrencyHelpTip
source: Number of pages to translate simultaneously. Higher values are faster but use more API quota. Recommended: 2-4.
fr_fr: Nombre de pages à traduire simultanément. Des valeurs plus élevées sont plus rapides mais consomment plus de quota API. Recommandé : 2-4.
ja_jp: 同時に翻訳するページ数。値が大きいほど高速ですが、API クォータの消費が増えます。推奨：2-4。
ko_kr: 동시에 번역할 페이지 수. 값이 클수록 빠르지만 API 할당량을 더 많이 사용합니다. 권장: 2-4.
zh_cn: 同时翻译的页面数。值越大速度越快，但消耗更多 API 配额。推荐：2-4。
zh_tw: 同時翻譯的頁面數。值越大速度越快，但消耗更多 API 配額。建議：2-4。

# LongDoc_PageRangeHelpTip
source: Specify pages to translate (PDF only). Examples: 1-3, 5, 7-10. Leave empty to translate all pages.
fr_fr: Spécifier les pages à traduire (PDF uniquement). Exemples : 1-3, 5, 7-10. Laisser vide pour traduire toutes les pages.
ja_jp: 翻訳するページを指定（PDF のみ）。例：1-3, 5, 7-10。空欄の場合はすべてのページを翻訳します。
ko_kr: 번역할 페이지 지정 (PDF만 해당). 예: 1-3, 5, 7-10. 비워두면 모든 페이지를 번역합니다.
zh_cn: 指定要翻译的页面（仅 PDF）。示例：1-3, 5, 7-10。留空则翻译所有页面。
zh_tw: 指定要翻譯的頁面（僅 PDF）。範例：1-3, 5, 7-10。留空則翻譯所有頁面。

# LongDoc_CjkFontTitle
source: Download CJK Font
fr_fr: Télécharger la police CJK
ja_jp: CJKフォントをダウンロード
ko_kr: CJK 글꼴 다운로드
zh_cn: 下载 CJK 字体
zh_tw: 下載 CJK 字型

# LongDoc_CjkFontMessage
source: CJK font (~16MB) is needed for proper {0} rendering in PDF. Download now?
fr_fr: La police CJK (~16 Mo) est nécessaire pour un rendu correct du {0} dans le PDF. Télécharger maintenant ?
ja_jp: PDFで{0}を正しく表示するにはCJKフォント（約16MB）が必要です。ダウンロードしますか？
ko_kr: PDF에서 {0}을(를) 올바르게 렌더링하려면 CJK 글꼴(~16MB)이 필요합니다. 지금 다운로드하시겠습니까?
zh_cn: 需要 CJK 字体（约16MB）才能正确渲染 PDF 中的{0}文字。是否下载？
zh_tw: 需要 CJK 字型（約16MB）才能正確呈現 PDF 中的{0}文字。是否下載？

# LongDoc_Download
source: Download
fr_fr: Télécharger
ja_jp: ダウンロード
ko_kr: 다운로드
zh_cn: 下载
zh_tw: 下載

# LongDoc_Skip
source: Skip
fr_fr: Ignorer
ja_jp: スキップ
ko_kr: 건너뛰기
zh_cn: 跳过
zh_tw: 略過

# MdxDictionaryReady
source: This dictionary is ready to use. No configuration needed.
ja_jp: この辞書は使用可能です。設定は不要です。
ko_kr: 이 사전은 사용할 준비가 되었습니다. 설정이 필요하지 않습니다.
zh_cn: 此词典已准备就绪，无需配置。
zh_tw: 此詞典已準備就緒，無需配置。

# MdxDeleteDictionary
source: Delete Dictionary
ja_jp: 辞書を削除
ko_kr: 사전 삭제
zh_cn: 删除词典
zh_tw: 刪除詞典

# MdxRedetectEncryption
source: Re-detect Encryption
ja_jp: 暗号化を再検出
ko_kr: 암호화 재감지
zh_cn: 重新检测加密
zh_tw: 重新偵測加密

# MdxDeleteConfirmTitle
source: Delete Dictionary
ja_jp: 辞書の削除
ko_kr: 사전 삭제
zh_cn: 删除词典
zh_tw: 刪除詞典

# MdxDeleteConfirmMessage
source: Are you sure you want to remove {0}? The dictionary file on disk will not be deleted.
ja_jp: {0} を削除してもよろしいですか？ディスク上の辞書ファイルは削除されません。
ko_kr: {0}을(를) 삭제하시겠습니까? 디스크의 사전 파일은 삭제되지 않습니다.
zh_cn: 确定要移除 {0} 吗？磁盘上的词典文件不会被删除。
zh_tw: 確定要移除 {0} 嗎？磁碟上的詞典檔案不會被刪除。

# MdxFilePath
source: File Path
ja_jp: ファイルパス
ko_kr: 파일 경로
zh_cn: 文件路径
zh_tw: 檔案路徑

# MdxRegistrationCode
source: Registration Code
ja_jp: 登録コード
ko_kr: 등록 코드
zh_cn: 注册码
zh_tw: 註冊碼

# MdxEncryptedHelpText
source: This dictionary is encrypted. Enter the email and registration code used when purchasing this dictionary.
ja_jp: この辞書は暗号化されています。購入時に使用したメールアドレスと登録コードを入力してください。
ko_kr: 이 사전은 암호화되어 있습니다. 구매 시 사용한 이메일과 등록 코드를 입력하세요.
zh_cn: 此词典已加密。请输入购买此词典时使用的邮箱和注册码。
zh_tw: 此詞典已加密。請輸入購買此詞典時使用的電子郵件和註冊碼。

# MdxEmailPlaceholder
source: Email address used for registration
ja_jp: 登録に使用したメールアドレス
ko_kr: 등록에 사용한 이메일 주소
zh_cn: 用于注册的邮箱地址
zh_tw: 用於註冊的電子郵件地址

# MddFilesDetected
source: Imported '{0}' with {1} companion resource file(s).
ja_jp: '{0}' をインポートしました。{1} 個の関連リソースファイルが見つかりました。
ko_kr: '{0}'을(를) 가져왔습니다. {1}개의 관련 리소스 파일이 있습니다.
zh_cn: 已导入 '{0}'，发现 {1} 个配套资源文件。
zh_tw: 已匯入 '{0}'，發現 {1} 個配套資源檔案。

# MddNoFilesDetected
source: Imported '{0}'. No companion MDD resource files found.
ja_jp: '{0}' をインポートしました。関連する MDD リソースファイルは見つかりませんでした。
ko_kr: '{0}'을(를) 가져왔습니다. 관련 MDD 리소스 파일이 없습니다.
zh_cn: 已导入 '{0}'。未找到配套 MDD 资源文件。
zh_tw: 已匯入 '{0}'。未找到配套 MDD 資源檔案。

# MddAddFile
source: Add MDD File...
ja_jp: MDD ファイルを追加...
ko_kr: MDD 파일 추가...
zh_cn: 添加 MDD 文件...
zh_tw: 新增 MDD 檔案...

# MddRescanFiles
source: Re-scan MDD Files
ja_jp: MDD ファイルを再スキャン
ko_kr: MDD 파일 다시 검색
zh_cn: 重新扫描 MDD 文件
zh_tw: 重新掃描 MDD 檔案

# MddAssociatedFiles
source: Resource Files
ja_jp: リソースファイル
ko_kr: 리소스 파일
zh_cn: 资源文件
zh_tw: 資源檔案

# EnabledServicesReorderButton
source: Reorder
fr_fr: Réorganiser
ja_jp: 並べ替え
ko_kr: 순서 변경
zh_cn: 排序
zh_tw: 排序

# EnabledServicesDoneReorderingButton
source: Done
fr_fr: Terminer
ja_jp: 完了
ko_kr: 완료
zh_cn: 完成排序
zh_tw: 完成排序

# SettingsTab_Services
source: Services
zh_cn: 服务
zh_tw: 服務

# SettingsTab_About_Tooltip
source: Version, links, feedback, and license.
fr_fr: Version, liens, retours et licence.
zh_cn: 查看版本、链接、反馈和许可证。
zh_tw: 查看版本、連結、回饋和授權。

# SettingsTab_General_Tooltip
source: Theme, startup, tray, clipboard, TTS, and behavior.
fr_fr: Thème, démarrage, barre d'état, presse-papiers, TTS et comportement.
zh_cn: 配置主题、启动、托盘、剪贴板、TTS 和常规行为。
zh_tw: 設定主題、啟動、系統匣、剪貼簿、TTS 和一般行為。

# SettingsTab_Advanced_Tooltip
source: OCR, layout detection, cache, proxy, and prompts.
fr_fr: OCR, détection de mise en page, cache, proxy et invites.
zh_cn: 配置 OCR、布局检测、缓存、代理和提示词。
zh_tw: 設定 OCR、版面偵測、快取、代理和提示詞。

# SettingsTab_Advanced
source: Advanced
fr_fr: Avancé
zh_cn: 高级
zh_tw: 進階

# SettingsTab_General
source: General
fr_fr: Général
zh_cn: 常规
zh_tw: 一般

source: Window Results
fr_fr: Résultats de la fenêtre
zh_cn: 窗口结果显示
zh_tw: 視窗結果顯示

# SettingsTab_Language
source: Language
fr_fr: Langue
zh_cn: 语言
zh_tw: 語言

# SettingsTab_Language_Tooltip
source: Translation languages, available languages, and UI language.
fr_fr: Langues de traduction, langues disponibles et langue de l'interface.
zh_cn: 配置翻译语言、可选语言和界面语言。
zh_tw: 設定翻譯語言、可用語言和介面語言。

# WindowResultsDescription
source: Choose which results appear in each window and whether each result queries automatically.
fr_fr: Choisissez les résultats affichés dans chaque fenêtre et si chaque résultat se lance automatiquement.
zh_cn: 选择每个窗口显示哪些结果，以及这些结果是否自动查询。
zh_tw: 選擇每個視窗顯示哪些結果，以及這些結果是否自動查詢。

# SettingsTab_About
source: About
fr_fr: À propos
zh_cn: 关于
zh_tw: 關於

# SettingsTab_Hotkeys_Tooltip
source: Configure app shortcuts and hotkey switches.
fr_fr: Configurer les raccourcis de l'application et leurs commutateurs.
zh_cn: 配置应用快捷键和快捷键开关。
zh_tw: 設定應用程式快捷鍵和快捷鍵開關。

# SettingsTab_Hotkeys
source: Hotkeys
fr_fr: Raccourcis
zh_cn: 快捷键
zh_tw: 快捷鍵

# SettingsTab_Services_Tooltip
source: Default services, API configuration, tests, and dictionaries.
fr_fr: Services par défaut, configuration de l'API, tests et dictionnaires.
zh_cn: 配置默认服务、API、服务测试和词典。
zh_tw: 設定預設服務、API、服務測試和詞典。

# SettingsTab_Views
source: Views
fr_fr: Vues
zh_cn: 视图
zh_tw: 視圖

# SettingsTab_Views_Tooltip
source: Choose visible results and query mode for each app view.
fr_fr: Définir les résultats visibles et le mode de requête pour chaque vue.
zh_cn: 配置每个应用视图显示哪些结果，以及是否自动查询。
zh_tw: 設定每個應用視圖顯示哪些結果，以及是否自動查詢。

# TtsSettingsHeader
source: TTS Output Settings
fr_fr: Paramètres de sortie TTS
ja_jp: TTS 出力設定
zh_cn: TTS 输出设置
zh_tw: TTS 輸出設定

# TtsSpeedLabel
source: TTS Reading Speed (0.5x - 3.0x)
fr_fr: Vitesse de lecture TTS (0,5× – 3,0×)
ja_jp: TTS 読み上げ速度 (0.5x - 3.0x)
zh_cn: TTS 朗读速度 (0.5x - 3.0x)
zh_tw: TTS 朗讀速度 (0.5x - 3.0x)

source: Auto-play translation
fr_fr: Lecture automatique de la traduction
ja_jp: 翻訳結果を自動再生
zh_cn: 自动朗读译文
zh_tw: 自動朗讀譯文

# HideEmptyServiceResults
source: Hide dictionaries with no result
fr_fr: Masquer les dictionnaires sans résultat
ja_jp: 結果のない辞書を非表示
zh_cn: 隐藏无结果的词典
zh_tw: 隱藏無結果的字典

# EnableLocalDictionarySuggestions
source: Enable custom dictionary input suggestions
fr_fr: Activer les suggestions de saisie des dictionnaires personnalisés
ja_jp: カスタム辞書の入力候補を有効化
zh_cn: 启用自定义词典输入建议
zh_tw: 啟用自訂字典輸入建議

source: Experimental
fr_fr: Expérimental
ja_jp: 実験的
zh_cn: 实验性
zh_tw: 實驗性

# OcrSettingsHeader
source: OCR (Text Recognition) Settings
fr_fr: Paramètres OCR (reconnaissance de texte)
ja_jp: OCR（文字認識）設定
zh_cn: OCR（文字识别）设置
zh_tw: OCR（文字辨識）設定

source: OCR Engine
fr_fr: Moteur OCR
ja_jp: OCR エンジン
zh_cn: OCR 引擎
zh_tw: OCR 引擎

# OcrEngineNative
source: Default (Windows Native)
fr_fr: Par défaut (Windows natif)
ja_jp: 既定（Windows ネイティブ）
zh_cn: 默认（Windows 原生）
zh_tw: 預設（Windows 原生）

# OcrEngineCustomApi
source: Custom API
fr_fr: API personnalisée
ja_jp: カスタム API
zh_cn: 自定义 API
zh_tw: 自訂 API

# OcrApiKey
source: API Key (Optional)
fr_fr: Clé API (facultatif)
ja_jp: API キー（任意）
zh_cn: API 密钥（可选）
zh_tw: API 金鑰（選填）

# OcrEndpoint
source: Endpoint
fr_fr: Point de terminaison
ja_jp: エンドポイント
zh_cn: 接入点
zh_tw: 端點

# OcrModel
source: Model
fr_fr: Modèle
ja_jp: モデル
zh_cn: 模型
zh_tw: 模型

# OcrSystemPrompt
source: System Prompt
fr_fr: Invite système
ja_jp: システムプロンプト
zh_cn: 系统提示词
zh_tw: 系統提示詞

source: Test OCR Connection
fr_fr: Tester la connexion OCR
ja_jp: OCR 接続をテスト
zh_cn: 测试 OCR 连接
zh_tw: 測試 OCR 連線

# OcrTestResult
source: Test Result
fr_fr: Résultat du test
ja_jp: テスト結果
zh_cn: 测试结果
zh_tw: 測試結果

# DeleteOnnxModel
source: Delete
fr_fr: Supprimer
ja_jp: 削除
zh_cn: 删除
zh_tw: 刪除

# VisionLLMDescription
source: Requires a configured API key for the selected service.
fr_fr: Nécessite une clé API configurée pour le service sélectionné.
ja_jp: 選択したサービスに API キーの設定が必要です。
zh_cn: 需要为所选服务配置 API 密钥。
zh_tw: 需要為所選服務設定 API 金鑰。

# MinimizeToTrayOnStartup
source: Start minimized to tray
fr_fr: Démarrer réduit dans la barre des tâches
ja_jp: 起動時にトレイに最小化
zh_cn: 启动后最小化到系统托盘
zh_tw: 啟動後最小化到系統匣

# MouseSelectionTranslate
source: Mouse selection translate (select text → click floating icon)
fr_fr: Traduction par sélection souris (sélectionner → cliquer sur l'icône flottante)
ja_jp: マウス選択翻訳（テキスト選択 → フローティングアイコンをクリック）
zh_cn: 划词翻译（选中文本 → 点击浮动图标）
zh_tw: 劃詞翻譯（選取文字 → 點擊浮動圖示）

# UILanguageDescription
source: Select the display language for the application interface. Restart required.
fr_fr: Sélectionnez la langue d'affichage de l'interface de l'application. Redémarrage requis.
ja_jp: アプリケーションインターフェースの表示言語を選択します。再起動が必要です。
zh_cn: 选择应用程序界面的显示语言。需要重启生效。
zh_tw: 選擇應用程式介面的顯示語言。需要重新啟動生效。

source: Excluded apps
fr_fr: Applications exclues
ja_jp: 除外アプリ
zh_cn: 排除应用
zh_tw: 排除應用

# ExcludedAppsDescription
source: Process names to exclude from mouse selection translate, separated by commas. Example: "code" for VS Code.
fr_fr: Noms de processus à exclure de la traduction par sélection, séparés par des virgules. Exemple : "code" pour VS Code.
ja_jp: マウス選択翻訳から除外するプロセス名をカンマ区切りで入力。例：VS Code は "code"。
zh_cn: 排除划词翻译的进程名称，用逗号分隔。示例："code" 代表 VS Code。
zh_tw: 排除劃詞翻譯的程序名稱，用逗號分隔。範例："code" 代表 VS Code。

# BuiltInAIDescription
source: Built-in AI uses Groq cloud service. No API key required. You can type a custom model name.
ar_sa: يستخدم الذكاء الاصطناعي المدمج خدمة Groq السحابية. لا يتطلب مفتاح API. يمكنك كتابة اسم نموذج مخصص.
da_dk: Indbygget AI bruger Groq-cloudtjenesten. Ingen API-nøgle påkrævet. Du kan skrive et brugerdefineret modelnavn.
de_de: Integrierte KI verwendet den Groq-Cloud-Dienst. Kein API-Schlüssel erforderlich. Sie können einen benutzerdefinierten Modellnamen eingeben.
hi_in: GLM (Zhipu AI) या Groq मुफ़्त model का उपयोग करता है। आप open.bigmodel.cn (GLM) या console.groq.com (Groq) से अपनी API key प्रदान कर सकते हैं।
id_id: Menggunakan model gratis GLM (Zhipu AI) atau Groq. Anda dapat menyediakan API key sendiri dari open.bigmodel.cn (GLM) atau console.groq.com (Groq).
it_it: L'AI integrata usa il servizio cloud Groq. Non richiede chiave API. Puoi digitare un nome di modello personalizzato.
ms_my: Menggunakan model percuma GLM (Zhipu AI) atau Groq. Anda boleh menyediakan kunci API sendiri dari open.bigmodel.cn (GLM) atau console.groq.com (Groq).
th_th: AI ในตัวใช้บริการคลาวด์ Groq ไม่ต้องใช้ API key คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: AI tích hợp sử dụng dịch vụ đám mây Groq. Không cần API key. Bạn có thể nhập tên model tùy chỉnh.

# TrayShow
source: Show
ar_sa: إظهار
da_dk: Vis
de_de: Anzeigen
hi_in: दिखाएँ
id_id: Tampilkan
it_it: Mostra
ms_my: Papar
th_th: แสดง
vi_vn: Hiển thị
